//
//  FlagMap.swift
//  TravelFriend
//
//  Created by 이재용 on 2/6/25.
//

import Foundation

let flagMap: [String: String] = [
    "중국": "🇨🇳",
    "유럽": "🇪🇺",
    "일본": "🇯🇵",
    "대한민국": "🇰🇷",
    "미국": "🇺🇸",
    "캐나다": "🇨🇦",
    "영국": "🇬🇧",
    "독일": "🇩🇪",
    "프랑스": "🇫🇷",
    "이탈리아": "🇮🇹",
    "스페인": "🇪🇸",
    "러시아": "🇷🇺",
    "브라질": "🇧🇷",
    "멕시코": "🇲🇽",
    "인도": "🇮🇳",
    "오스트레일리아": "🇦🇺",
    "아르헨티나": "🇦🇷",
    "사우디아라비아": "🇸🇦",
    "남아프리카공화국": "🇿🇦",
    "터키": "🇹🇷",
    "인도네시아": "🇮🇩",
    "싱가포르": "🇸🇬",
    "태국": "🇹🇭",
    "말레이시아": "🇲🇾",
    "필리핀": "🇵🇭",
    "베트남": "🇻🇳",
    "이집트": "🇪🇬",
    "이스라엘": "🇮🇱",
    "아랍에미리트": "🇦🇪",
    "네덜란드": "🇳🇱",
    "벨기에": "🇧🇪",
    "스웨덴": "🇸🇪",
    "노르웨이": "🇳🇴",
    "덴마크": "🇩🇰",
    "핀란드": "🇫🇮",
    "스위스": "🇨🇭",
    "오스트리아": "🇦🇹",
    "포르투갈": "🇵🇹",
    "그리스": "🇬🇷",
    "폴란드": "🇵🇱",
    "체코": "🇨🇿",
    "헝가리": "🇭🇺",
    "우크라이나": "🇺🇦",
    "아일랜드": "🇮🇪",
    "뉴질랜드": "🇳🇿",
    "콜롬비아": "🇨🇴",
    "칠레": "🇨🇱",
    "페루": "🇵🇪",
    "쿠바": "🇨🇺",
    "카타르": "🇶🇦",
    "파키스탄": "🇵🇰",
    "방글라데시": "🇧🇩",
    "나이지리아": "🇳🇬",
    "케냐": "🇰🇪",
    "이란": "🇮🇷"
]

// 디폴트 국기 (국가 정보가 없을 때 사용)
let defaultFlag = "🏳️" // 또는 "🌍"
