//
//  locationList.swift
//  TravelFriend
//
//  Created by 이재용 on 2/6/25.
//


var locationListSample: [String] = [
    // 음식 및 카페
    "식당", "카페", "술집", "바", "펍",
    "푸드코트", "패스트푸드점", "디저트 카페", "로컬 맛집", "미쉐린 레스토랑",
    "포장마차", "전통주점", "와인바", "칵테일바", "베이커리",
    
    // 쇼핑
    "쇼핑몰", "시장", "백화점", "아울렛", "편집샵",
    "면세점", "기념품 가게", "전통 공예점", "디자이너 브랜드 매장", "노점상",
    "벼룩시장", "중고매장", "전자상가", "서점", "문구점",
    
    // 문화 및 예술
    "박물관", "미술관", "전시회", "갤러리", "역사관",
    "문화유산 센터", "오페라하우스", "콘서트홀", "공연장", "국립극장",
    "뮤지컬 극장", "소극장", "전통문화체험관", "공공 미술 설치물", "독립 영화관",
    
    // 랜드마크 및 관광명소
    "랜드마크", "탑", "기념비", "궁궐", "성",
    "사찰", "사원", "대성당", "교회", "이슬람 사원",
    "모스크", "불상", "동상", "유적지", "세계문화유산",
    
    // 교통 관련
    "기차역", "버스정류장", "공항", "항구", "여객터미널",
    "렌터카 센터", "지하철역", "케이블카 정류장", "곤돌라 정류장", "택시 승강장",
    
    // 숙박 및 휴식
    "호텔", "모텔", "리조트", "호스텔", "게스트하우스",
    "펜션", "캠핑장", "카라반 캠핑장", "스파 리조트", "온천",
    
    // 자연 및 야외활동
    "해변", "산", "국립공원", "자연공원", "폭포",
    "계곡", "호수", "전망대", "서핑 스팟", "등산로",
    "하이킹 코스", "자전거 도로", "낚시터", "스키 리조트", "스노보드 파크",
    "수상 레저 센터", "다이빙 스팟", "산림욕장", "동굴", "사막",
    
    // 스포츠 및 레저
    "골프장", "테니스 코트", "볼링장", "암벽 등반 센터", "수영장",
    "요트 클럽", "서핑 클럽", "경마장", "스케이트장", "카트 레이싱장",
    "양궁장", "농구장", "축구장", "배구장", "헬스장",
    
    // 엔터테인먼트 및 놀이시설
    "놀이공원", "유원지", "테마파크", "동물원", "수족관",
    "게임 센터", "방탈출 카페", "보드게임 카페", "PC방", "노래방",
    "코인노래방", "만화카페", "VR 체험관", "e스포츠 경기장", "오락실",
    
    // 교육 및 체험
    "천문대", "도서관", "과학관", "교육 체험관", "전통 공예 체험장",
    "요리 학원", "외국어 학습 센터", "댄스 스튜디오", "스포츠 아카데미", "서핑 스쿨",
    
    // 공공시설 및 기타
    "병원", "약국", "우체국", "은행", "경찰서",
    "소방서", "대사관", "공공청사", "컨벤션 센터", "시청",
    "법원", "도심 공원", "광장", "페스티벌 광장", "야시장"
]
